app/controllers/churches_controller.rb

SELECT * FROM "churches" WHERE (name LIKE '%So%')
---
  def index
    @churches = Church.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])