app/controllers/navigation_controller.rb

  def search
    unless params[:query].blank?
      @stampeders = Stampeder.find(:all, :conditions => ['fullname LIKE ?', "%#{params[:query]}%"], :include => [:team, :stampeder])
---
SELECT * FROM "stampeders" WHERE ("stampeders"."id" IN (22,9,37,1,21))
SELECT * FROM "teams" WHERE ("teams"."id" IN (2,4))