app/controllers/points_controller.rb

  def index
    @today = Date.today
    @teams = Team.all
    @points = Point.find_all_by_day(@today)
    if @points.empty?
      @teams.each do |team|
        team.points.create(:day => @today)
      end
    else
      @points.each do |point|
        if @teams.include?(point.team)
---
SELECT * FROM "teams"
SELECT * FROM "points" WHERE ("points"."day" = '2010-03-28') LIMIT 1
SELECT * FROM "points"
INSERT INTO "points" ("team_id", "updated_at", "indoor_games", "previous_points", "day", "spirit_points", "deductions", "most_friends", "outdoor_games", "created_at") VALUES(1, '2010-04-02 01:06:05', NULL, NULL, '2010-04-01', NULL, NULL, NULL, NULL, '2010-04-02 01:06:05')
SELECT * FROM "teams" WHERE ("teams"."id" = 1)