app/controllers/public_controller.rb

SELECT * FROM "churches" WHERE ("churches"."name" = 'McKinney Memorial Bible Church') LIMIT 1
SELECT * FROM "stampeders" WHERE ("stampeders"."id" = 1) LIMIT 1
---
  def sign_up
    @stampeder = Stampeder.new
    @mmbc = Church.find_by_name("McKinney Memorial Bible Church")
    @friend = Stampeder.find_by_id(params[:referral_code].to_i / REFERRAL_CONSTANT)

SELECT * FROM "churches" WHERE ("churches"."name" = 'Southcliff Baptist Church') LIMIT 1
INSERT INTO "churches" ("name", "updated_at", "created_at") VALUES('Southcliff Baptist Church', '2010-05-03 22:23:27', '2010-05-03 22:23:27')
INSERT INTO "stampeders" ("address", "city", "grade", "created_at", "dob", "parent", "church_id", "subgroup", "textmsg", "updated_at", "zipcode", "notes", "fullname", "lastname", "gender", "parentphone", "online_signup", "firstname", "studentphone", "team_id", "parentemail", "state", "email", "friend_id", "school_id", "day_id") VALUES('7912 Vista Ridge Dr N', 'Fort Worth', 7, '2010-05-28 18:20:34', '1997-03-04', 'Franny', 1, '7f', 't', '2010-05-28 18:20:34', '76132', NULL, 'Fanny Mc Gehee', 'Mc Gehee', 'f', '8175462154', 't', 'Fanny', '8175868669', NULL, 'will@willcosgrove.com', 'TX', 'jesusfreak210@gmail.com', NULL, 2, NULL)
UPDATE "stampeders" SET "created_at" = '2010-05-22 23:11:49', "parentemail" = 'jesusfreak210@gmail.com', "email" = 'jesusfreak210@gmail.com', "school_id" = 2, "subgroup" = '8m', "studentphone" = '', "lastname" = 'Cosgrove', "firstname" = 'Will', "dob" = '1993-02-10', "grade" = 8, "city" = 'Fort Worth', "parent" = 'Kim Cosgrove', "online_signup" = 't', "barcode" = '1048', "parentphone" = '', "zipcode" = '76132', "state" = 'TX', "address" = '7912 Vista Ridge Dr N', "gender" = 'm', "textmsg" = 't', "updated_at" = '2010-05-22 23:11:49', "fullname" = 'Will Cosgrove' WHERE "id" = 48
SELECT * FROM "stampeders" WHERE ("stampeders"."id" = 20) LIMIT 1
---
  def register
    #debugger
    @stampeder = Stampeder.new(params[:stampeder])
    if params[:referral_code].match(/\A\D*\Z/)
      @stampeder.notes = params[:referral_code]
    else
      @stampeder.friend_id = params[:referral_code].to_i / REFERRAL_CONSTANT unless params[:referral_code] == "" || @stampeder.church == Church.find_by_name("McKinney Memorial Bible Church")
    end
    @stampeder.online_signup = true
    @stampeder.textmsg = false if @stampeder.textmsg.nil?
    @stampeder.church = nil if params[:does_not_attend_church] == true

    respond_to do |format|
      if @stampeder.save
        flash[:notice] = "You have been signed up!"
        format.html { redirect_to :action => "registered", :id => @stampeder.id }
        format.xml  { render :xml => @stampeder, :status => :created, :location => @stampeder }
        Notifier.deliver_welcome_letter(@stampeder)
        Notifier.deliver_information_letter(@stampeder)
        Twilio.connect(TWILIO_SID, TWILIO_AUTH_TOKEN)
        Twilio::Sms.message('8173304437', @stampeder.studentphone, "Hey, thanks for signing up for Stampede!  Tell all of your friends to sign up with your friend code: #{@stampeder.referral_code}") if @stampeder.textmsg && @stampeder.studentphone
      else
        @mmbc = Church.find_by_name("McKinney Memorial Bible Church")
        @friend = Stampeder.find_by_id(params[:referral_code].to_i / REFERRAL_CONSTANT)

SELECT * FROM "stampeders" WHERE ("stampeders"."id" = '1') LIMIT 1
---
  def registered
    require 'cgi'
    @stampeder = Stampeder.find_by_id(params[:id])

SELECT * FROM "stampeders" WHERE ("stampeders"."id" = 0) LIMIT 1
---
  def referral_lookup
    @f = Stampeder.find_by_id(params[:q].to_f / REFERRAL_CONSTANT)