app/controllers/registration_controller.rb

INSERT INTO "stampeders" ("address", "city", "grade", "created_at", "dob", "parent", "church_id", "subgroup", "textmsg", "updated_at", "zipcode", "notes", "fullname", "lastname", "gender", "parentphone", "online_signup", "firstname", "studentphone", "team_id", "parentemail", "state", "email", "friend_id", "school_id") VALUES('1832 Farley Ct', 'Fort Worth', 7, '2010-05-27 20:03:08', '1994-07-08', 'Not Seth', 1, '7f', 'f', '2010-05-27 20:03:08', '92731', NULL, 'Karen Austin', 'Austin', 'f', '', 'f', 'Karen', '', 3, 'notseth@seth.net', 'TX', 'karen@seth.net', NULL, 1)
---
  def register_stampeder
    @stampeder = Stampeder.new(params[:stampeder])
    @stampeder.online_signup = false
    @stampeder.save

SELECT * FROM "stampeders" WHERE ("stampeders"."id" = 7)
UPDATE "stampeders" SET "updated_at" = '2010-05-09 16:44:31', "barcode" = '5574' WHERE "id" = 45
INSERT INTO "signins" ("created_at", "stampeder_id", "updated_at", "day_signed_in") VALUES('2010-05-09 16:44:31', 45, '2010-05-09 16:44:31', '2010-05-09 11:44:31')
---
  def add_barcode
    @stampeder = Stampeder.find(params[:id])
    @stampeder.update_attribute(:barcode, params[:barcode])
    @stampeder.signins.create( :day_signed_in => Time.now )

SELECT * FROM "stampeders" ORDER BY lastname
---
  def fill_in
    @stampeders = Stampeder.find(:all, :order => "lastname").select { |stampeder| stampeder.missingInfo? }
    if @stampeders.size > 1

SELECT * FROM "stampeders" WHERE ("stampeders"."team_id" = 1) ORDER BY lastname LIMIT 1
SELECT * FROM "stampeders" ORDER BY lastname LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "stampeders"
SELECT * FROM "teams"
---
  def view_all
    @t1Stampeders = Stampeder.find_all_by_team_id(1, :order => "lastname")
    @t2Stampeders = Stampeder.find_all_by_team_id(2, :order => "lastname")
    @t3Stampeders = Stampeder.find_all_by_team_id(3, :order => "lastname")
    @t4Stampeders = Stampeder.find_all_by_team_id(4, :order => "lastname")
    @stampeders = Stampeder.paginate :order => "lastname", :page => params[:page]
    @teams = Team.all