app/controllers/schools_controller.rb

SELECT * FROM "schools" WHERE (name LIKE '%%')
---
  def index
    @schools = School.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])