app/controllers/signins_controller.rb

  def create
    @stampeder = Stampeder.find_by_barcode(params[:barcode])
    Signin.create(:stampeder_id => @stampeder.id, :day_signed_in => Time.now)
---
SELECT * FROM "stampeders" WHERE ("stampeders"."barcode" = '1993') LIMIT 1
INSERT INTO "signins" ("updated_at", "stampeder_id", "day_signed_in", "created_at") VALUES('2010-03-19 06:25:04', 1, '2010-03-19 01:25:04', '2010-03-19 06:25:04')