app/controllers/stampeders_controller.rb

SELECT * FROM "stampeders"
---
  def index
    @stampeders = Stampeder.all

SELECT * FROM "stampeders" WHERE ("stampeders"."id" = 1) LIMIT 1
---
  def show
    @stampeder = Stampeder.find(params[:id])

SELECT * FROM "stampeders" WHERE ("stampeders"."id" = 1)
---
  def edit
    @teams = Team.find(:all)
    @stampeder = Stampeder.find(params[:id])

INSERT INTO "stampeders" ("city", "team_id", "grade", "updated_at", "dob", "subgroup", "text", "zipcode", "barcode", "parentphone", "fullname", "lastname", "firstname", "gender", "studentphone", "address", "school", "state", "created_at", "parent", "email", "friend_id") VALUES('Fort Worth', 2, 8, '2010-03-16 19:23:22', '1995-08-02', '8m', 't', 76132, 9999, '8475682351', 'Will Cosgrove', 'Scott', 'James', 'm', '8174521352', '78456 Scott Rd', 'TVS', 'TX', '2010-03-16 19:23:22', 'Gregory Scott', 'james.scott@gmail.com', NULL)
---
  def create
    @stampeder = Stampeder.new(params[:stampeder])
    @stampeder.createSubgroup

SELECT * FROM "stampeders" WHERE ("stampeders"."id" = 1)
UPDATE "stampeders" SET "email" = '', "school_id" = 1, "studentphone" = '', "city" = 'Fort Worth', "parent" = '', "parentphone" = '', "zipcode" = '', "state" = 'TX', "address" = '', "updated_at" = '2010-04-01 20:58:21' WHERE "id" = 22
---
  def update
    @stampeder = Stampeder.find(params[:id])
    @stampeder.parentphone.gsub!(/\D/, "")

    respond_to do |format|
      if @stampeder.update_attributes(params[:stampeder])

SELECT * FROM "stampeders" WHERE ("stampeders"."id" = 6)
DELETE FROM "stampeders" WHERE "id" = 6
---
  def destroy
    @stampeder = Stampeder.find(params[:id])
    @stampeder.destroy

SELECT * FROM "stampeders" WHERE (fullname LIKE '%%')
---
  def autocomplete
    @stampeders = Stampeder.find(:all, :conditions => ['fullname LIKE ?', "%#{params[:search]}%"])