app/controllers/statistics_controller.rb

SELECT * FROM "teams"
SELECT * FROM "teams" WHERE ("teams"."name" = 'Red') LIMIT 1
SELECT * FROM "stampeders" WHERE ("stampeders"."subgroup" = '6m') LIMIT 1
SELECT * FROM "stampeders" WHERE ("stampeders"."team_id" = 1 AND "stampeders"."subgroup" = '6m') LIMIT 1
---
  def index
    @teams = Team.all
    @red = Team.find_by_name("Red")
    @green = Team.find_by_name("Green")
    @blue = Team.find_by_name("Blue")
    @yellow = Team.find_by_name("Yellow")
    @sg_6m = Stampeder.find_all_by_subgroup("6m")
    @sg_7m = Stampeder.find_all_by_subgroup("7m")
    @sg_8m = Stampeder.find_all_by_subgroup("8m")
    @sg_9m = Stampeder.find_all_by_subgroup("9m")
    @sg_6f = Stampeder.find_all_by_subgroup("6f")
    @sg_7f = Stampeder.find_all_by_subgroup("7f")
    @sg_8f = Stampeder.find_all_by_subgroup("8f")
    @sg_9f = Stampeder.find_all_by_subgroup("9f")
    @red_6m = Stampeder.find_all_by_team_id_and_subgroup(1,"6m")

SELECT * FROM "stampeders"
---
    @yellow_7f = Stampeder.find_all_by_team_id_and_subgroup(4,"7f")
    @yellow_8f = Stampeder.find_all_by_team_id_and_subgroup(4,"8f")
    @yellow_9f = Stampeder.find_all_by_team_id_and_subgroup(4,"9f")
    @stampeders = Stampeder.all