app/controllers/teams_controller.rb

SELECT * FROM "teams"
---
  def index
    @teams = Team.all

SELECT * FROM "teams" WHERE ("teams"."id" = 1)
---
  def show
    @team = Team.find(params[:id])

SELECT * FROM "teams" WHERE ("teams"."id" = 1)
---
  def edit
    @team = Team.find(params[:id])

INSERT INTO "teams" ("name", "updated_at", "indoor_games_points", "previous_points", "spirit_points", "deductions", "outdoor_games_points", "friend_points", "created_at") VALUES('Red', '2010-03-07 21:54:09', 0, 0, 0, 0, 0, 0, '2010-03-07 21:54:09')
---
  def create
    @team = Team.new(params[:team])

    respond_to do |format|
      if @team.save

SELECT * FROM "teams" WHERE ("teams"."id" = 2)
UPDATE "teams" SET "deductions" = 0, "friend_points" = 0, "indoor_games_points" = 0, "outdoor_games_points" = 0, "previous_points" = 0, "spirit_points" = 0, "updated_at" = '2010-03-07 22:30:03' WHERE "id" = 2
---
  def update
    @team = Team.find(params[:id])

    respond_to do |format|
      if @team.update_attributes(params[:team])